const questions = [
    {
        question: 'В кой филм на дисни е  представена Урсула?',
        answers: [
            { text: 'Малкият картоф', correct: false },
            { text: 'Малката русалка', correct: true },
            { text: 'Книга за джунглата', correct: false },
            { text: 'Питър Пан', correct: false },
        ],
        explanation: '„Малката русалка“ (на английски: The Little Mermaid) е американски анимационен романтичен фентъзи филм от 1989 г. Филмът разказва за русалката принцеса на име Ариел, която мечтае да стане човек и се влюбва в принц на име Ерик, който е човек, което я кара да сключи магическа сделка със зла морска вещица Урсула, за да стане човек и да бъде с него.'
    }, {
        question: 'Как се казва злодея в „Цар лъв“?',
        answers: [
            { text: 'Стар', correct: false },
            { text: 'Сърма', correct: false },
            { text: 'Скар', correct: true },
            { text: 'Петко', correct: false },
        ],
        explanation: 'Цар лъв (на английски: The Lion King) е американски анимационен филм от 1994 г. Цар лъв разказва историята на Симба, млад лъв, който ще наследи баща си, Муфаса, като цар на Лъвските земи; въпреки това, след като чичо му Скар убива Муфаса, за да владее над кралството на Муфаса, Симба е манипулиран да мисли, че е отговорен и бяга в изгнание. След съзряването си, Симба получава ценни съвети от приятелката си от детството, Нала и неговия шаман, Рафики, преди да се върне, за да оспори Скар и да прекрати тиранията му, за да заеме мястото си в Кръговрата на живота като законен крал.'
    }, {
        question: 'Кой е най-добрият приятел на Маккуин?',
        answers: [
            { text: 'Матю', correct: true },
            { text: 'Пери', correct: false },
            { text: 'Сали', correct: false },
            { text: 'Шерифът', correct: false },
            { text: 'Мулан', correct: false },
        ],
        explanation: 'Първокласната състезателна кола–новобранец Маккуин Светкавицата живее живот на бързи обороти, докато не се отклонява по пътя към най-важното състезание в живота си. Заседнал в Радиатор Спрингс, забравен град по стария маршрут 66, той среща Сали, Матю, Док Хъдсън и множество странни същества, които му помагат да открие, че животът е нещо повече от трофеи и слава.'
    }, {
        question: 'Кой е Шир-Хан?',
        answers: [
            { text: 'Русалката от малката русалка', correct: false },
            { text: 'Кокошката на съседа', correct: false },
            { text: 'Тигара от Книга за джунглата', correct: true },
            { text: 'Злодеят в мулан', correct: false },
        ],
        explanation: 'Шир Хан, Шир-Хан или Ширхан е измислен герой, бенгалски тигър от книгата на Ръдиърд Киплинг „Книга за джунглата“. Той е главният враг на Маугли. Киплинг го кръщава на Шер шах или Шер хан, мюсюлмански военноначалник от 16 век, един от най-големите реформатори на Индия. Според самия Киплинг името е трябвало да се произнася Скирхан, но е навлязло като Ширхан. Шир на хинди означава лъв, тигър, а хан - владетел. Ширхан е роден с недостатък и накуцва, затова собствената му майка го нарича Лунгри - куцият. Въпреки това той е арогантен и се счита за единствен владетел на джунглата. След като Маугли го убива, той одира кожата му.'
    }, {
        question: 'Кой се бори с Капитан Хук?',
        answers: [
            { text: 'Светкавицата Маккуийн', correct: false },
            { text: 'Мулан', correct: false },
            { text: 'Мушу', correct: false },
            { text: 'Пешо', correct: false },
            { text: 'Питър Пан и изгубените момчета', correct: true },
        ],
        explanation: 'Капитан Джеймс Хук е главният антагонист в анимацията Питър Пан от 1953, в която той е главният враг на Питър Пан. Героят е капитан пират на кораба Джоли Роджър. Двата му основни страха са гледката на собствената му кръв (предполага се с неестествен цвят) и крокодила, който го преследва, след като изяде ръката, отсечена от Пан. Желязна кука заменя отрязаната му ръка, която дава името на пирата.'
    }, {
        question: 'Как се казва помощника на Гастон?',
        answers: [
            { text: 'Луис', correct: false },
            { text: 'Лорънс', correct: false },
            { text: 'Луи', correct: false },
            { text: 'Лефу', correct: true },
        ],
        explanation: 'Гастон е измислен герой в анимационния филм на Walt Disney Pictures Красавицата и звяра (1991). Гастон е арогантен и безмилостен ловец, чиито несподелени чувства към интелектуалката Бел го карат да убие своя противник, Звяра, след като разбира, че тя се грижи за него. И през цялото време до себе си има помощник на име Лефу, който го подкрепя в неговите действия.'
    }, {
        question: 'Как се казва филма на дисни, в който планетата е загинала и се запознаваме с роботче събиращу интересни предмети?',
        answers: [
            { text: 'Виктор юго', correct: false },
            { text: 'Пинокио', correct: false },
            { text: 'УОЛ-И', correct: true },
            { text: 'Мери попинз', correct: false },
            { text: 'Тютюн', correct: false },
            { text: 'Мулан', correct: false },
        ],
        explanation: 'УОЛ-И е американски анимационен научнофантастичен романтичен филм от 2008 г., продуциран от Pixar Animation Studios за Walt Disney Pictures. Филмът проследява самотен робот на име УОЛ-И на бъдеща, необитаема, изоставена Земя през 2805 г., оставен да почиства боклука. Той е посетен от робот, наречен ИВА, изпратен от звездния кораб Axiom, в когото се влюбва и го преследва из галактиката. '
    }, {
        question: 'Коя дисни принцеса, не е принцеса и влиза в армията, за да спаси баща си и държавата си?',
        answers: [
            { text: 'Мулан', correct: true },
            { text: 'Покахонтас', correct: false },
            { text: 'Петър', correct: false },
            { text: 'Ваяна', correct: false },
            { text: 'Мерида', correct: false },
        ],
        explanation: 'Мулан е американски анимационен музикален екшън-приключенски филм от 1998 г., продуциран от Walt Disney Feature Animation за Walt Disney Pictures. Базиран е на китайската легенда за Хуа Мулан. Сюжетът на филма се развива в Китай по време на неуточнена императорска династия, където Фа Мулан, дъщеря на възрастния воин Фа Джоу, се представя за мъж, за да заеме мястото на баща си по време на обща военна служба за противодействие на хунското нашествие.'
    }, {
        question: 'На коя дисни принцеса тримата и братя се превръщат в мечета?',
        answers: [
            { text: 'Тиана', correct: false },
            { text: 'Жасмин', correct: false },
            { text: 'Мерида', correct: true },
            { text: 'Ваяна', correct: false },
        ],
        explanation: 'Храбро сърце е американски компютърно анимиран филм от 2012 година, продуциран от Disney/Pixar. Храбрата принцеса Мерида е дръзка девойка, опитен стрелец с лък и е решена сама да проправя пътя си в живота. Мерида се опълчва на вековен обичай с който отприщва събития, които я принуждават да открие истинската храброст.'
    }, {
        question: 'В кой филм на дисни главните герои са Куче, котка и хамстер, кучето вярва, че притежава супер сили, когато попада на улицата разбира, че не е така и неговата цел е да стигне до стопанина си?',
        answers: [
            { text: 'Спящата красавица', correct: false },
            { text: 'Терминаторът', correct: false },
            { text: 'Момчето и чаплата', correct: false },
            { text: 'Годзила', correct: false },
            { text: 'Гръм', correct: true },
            { text: 'Опенхаймер', correct: false },
            { text: 'Барби', correct: false },
        ],
        explanation: 'Гръм е американски анимационен екшън приключенски филм от 2008 г., продуциран от Walt Disney Animation Studios и издаден от Walt Disney Pictures. Сюжетът на филма се съсредоточава върху куче на име Гръм, което е прекарало целия си живот на снимачната площадка на телевизионен сериал и твърдо вярва, че притежава суперсили. Когато любимата му собственичка Пени е „отвлечена“ в шоуто, Гръм бяга от снимачната площадка, за да я спаси, като в крайна сметка се обединява със саркастичната улична котка Митенс и хамстер на име Райно, който е фен на телевизионния сериал на Гръм, за да се впуснат в пътешествие обратно у дома.'
    }, {
        question: 'Група орнитолози наблюдавали множецтво осакатени и обезобразени птиченца на остров фоули. Какво е пречинило тези наранявания?',
        answers: [
            { text: 'Видри', correct: false },
            { text: 'Таралежи', correct: false },
            { text: 'Овце', correct: true },
            { text: 'Чайки', correct: false },
            { text: 'Лисици', correct: false },
            { text: 'Зайци', correct: false },
            { text: 'Пеперуди', correct: false },
        ],
        explanation: 'Фоула е отдалечен остров на повече от 300 километра от Шотландия и в продължение на поколения прелетните птици, особено арктическите рибарки, го използват като място за гнездене, за да отглеждат пилетата си, но група орнитолози забелязват тенденция на осакатени пиленца. Учените наблюдавали как пасящи овце се натъкват на беззащитни пиленца и без да се замислят ги грабвали и ги изяждали. От 1973 до 1980 г. е наблюдавано, че близо 700 малки птици са били жертви на кръвожадните овце.'
    }, {
        question: 'Какъв е оригиналния цвят на портокалите?',
        answers: [
            { text: 'Зелен', correct: true },
            { text: 'Оранжев', correct: false },
            { text: 'Черен', correct: false },
            { text: 'Лилав', correct: false },
            { text: 'Кафяв', correct: false },
            { text: 'Жълт', correct: false },
        ],
        explanation: 'В естествената си зряла форма в топлите страни, в които се отглеждат, портокалите са зелени. Този цвят им придава външният слой, съдържащ много хлорофил. На по-хладни места хлорофилът в кората се разпада, също както е при листата на дърветата, и така лъсва на показ оранжевият цвят на месестата част. Всъщност зелените портокали са узрели, а обагрените в оранжево вече се смятат за презрели. Но хората са свикнали да свързват зеления цвят на плодовете с недозрялост, затова много портокали изкуствено се „боядисват“ в оранжево.  В името на индустрията. За целта се третират с етилен, страничен продукт от нефтената промишленост - газ, чиято основна област на приложение е пластмасата. Етиленът обезцветява естествения зелен цвят на портокала и той се появява в познатия ни вид. Друг начин портокалите да добият привлекателния си оранжев цвят, е като се замразят.'
    }, {
        question: 'Коя част на тялото продължава да расте и сле 21 годишна възраст при хората?',
        answers: [
            { text: 'Очите', correct: false },
            { text: 'Ушите', correct: true },
            { text: 'Ръцете', correct: false },
            { text: 'Краката', correct: false },
            { text: 'Пръстите', correct: false },
        ],
        explanation: 'Ушите растат средно с 0.22 мм годишно. Така например 30-годишен човек може да очаква, че докато стане на 80 години, ушите му ще са пораснали с малко повече от сантиметър. Този растеж обаче започва да се забавя, когато детето навърши 8 до 10-годишна възраст. След като хората станат на 85 години, ушите им достигат най-високата си средна дължина.'
    }, {
        question: 'Кое от изброените животни има най-много кости на врата?',
        answers: [
            { text: 'Медуза', correct: false },
            { text: 'Слон', correct: false },
            { text: 'Човек', correct: false },
            { text: 'Мишка', correct: false },
            { text: 'Жирав', correct: false },
            { text: 'Ленивец', correct: true },
        ],
        explanation: 'Жирафът има същия брой вратни прешлени като човек, мишка, слон или броненосец; всички имат точно седем. Изключение правят ленивците с до 10 прешлена на врата.'
    }, {
        question: 'Кое от изброените е собственост на британската корона?',
        answers: [
            { text: 'Нотр Дам дьо Шартър или „Света Богородица от Шартър“', correct: false },
            { text: 'Колизеумът', correct: false },
            { text: 'Тадж Махал', correct: false },
            { text: 'Гълъбови изпражнения', correct: true },
        ],
        explanation: 'През 18-ти век крал Джордж I постановява всички гълъбови изпражнения да бъдат собственост на короната. Той дори поставя пазачи на местата, където кацаха птиците, за да наложи заповедта си. Той не е бил любител на птиците. Имало е практическа причина за заповедта му: гълъбовата тор се е използвала за направата на барут.'
    }, {
        question: 'Кое се смята за 1вия роман в света?',
        answers: [
            { text: 'Тютюн', correct: false },
            { text: 'Градината на боговете', correct: false },
            { text: 'Сказание за Генджи', correct: true },
            { text: 'Тримата мускетари', correct: false },
            { text: 'Железният светилник', correct: false },
        ],
        explanation: '„Сказание за Генджи” – книгата, написана преди хиляда години, в разцвета на периода Хеян – се смята за първия роман в света поради големия ѝ обхват и влияние. Но най-изненадващото в „Сказание за Генджи“ не е фактът, че това класическо произведение на японската литература е прието за първо по рода си в света, а че всъщност е написано от жена: Мурасаки Шикибу. Докато историците все още спорят дали има и по-ранни романи, влиянието на „Сказание за Генджи” е признато за безпрецедентно. Книгата е разказ в проза, писан преди 1000 години. Английският превод обхваща 1300 страници. Така че това е монументално литературно произведения, единствено по рода си в такива мащаби.'
    }, {
        question: 'Кое животно е било популярно между 1930 до 1960 в америка за рабиране дали една жена е бременна?',
        answers: [
            { text: 'Лисицата', correct: false },
            { text: 'Гаргите', correct: false },
            { text: 'Мухите', correct: false },
            { text: 'Мечките', correct: false },
            { text: 'Жабите', correct: true },
            { text: 'Коткие', correct: false },
        ],
        explanation: 'Тестът Хогбен, кръстен на британския зоолог Ланселот Хогбен, е бил един от най-надеждните и бързи тестове за бременност от 40-те до 60-те години на миналия век. Фармацевтите инжектирали проба от урината на жената (като е трябвало да бъде няколко седмици след пропуснат период за да проработи теста) в африканска ноктеста жаба и бременността им се потвърждавала в рамките на 18 часа с хвърлянето на яйца от жабата.'
    }, {
        question: 'За какво са се използвали първоначално резачките?',
        answers: [
            { text: 'За рязане на дървета', correct: false },
            { text: 'За раждане', correct: true },
            { text: 'За мъчения', correct: false },
            { text: 'За готвене', correct: false },
            { text: 'За музикален инструмент', correct: false },
            { text: 'За играчка', correct: false },
        ],
        explanation: 'Резачките са били разработени в Шотландия в края на 18-ти век, за да подпомогне и ускори процеса на симфизиотомия (процедура включваща прерязване на една от основните тазови стави и „разкачане“ на таза, за да се улесни естественото раждане) по време на раждане. Това е било голям медицински пробив и се е използвал през останалата част от 19 век в операциите. Едва в началото на 20-ти век е започнало да се използват резачки за цепене на дърва.'
    }, {
        question: 'Могат ли тревопасните животни да ядат месо?',
        answers: [
            { text: 'Да', correct: true },
            { text: 'Не', correct: false },
        ],
        explanation: 'Да, много тревопасни с удоволствие ще ядат месо, което е налично, и най-вероятно дори няма да се налага да гo подмамват, за да го добавят в менюто си. Някои тревопасни ядат мърша и пиленца в дивата природа. Яденето на твърде много месо обаче ще навреди на тревопасното животно, но не всички тревопасни могат да ядат месо като например коалите и ленивците.'
    }, {
        question: 'Колко конски сили има един кон?',
        answers: [
            { text: '1', correct: false },
            { text: '5', correct: false },
            { text: '12', correct: true },
            { text: '30', correct: false },
            { text: '100', correct: false },
            { text: '500', correct: false },
        ],
        explanation: 'В действителност максималната механична мощност на коня е доста над 12 конски сили. Тази цифра идва от дуо учени, които през 1993 г. публикуват статия в списание Nature. Според изчисленията им един кон би трябвало да има 24 конски сили. Те обаче пишат, че това вероятно е надценяване. Позовавайки се на някои данни отпреди десетилетия, те смятат, че един годен кон вероятно би могъл да изпомпва между 12 и 14.9 конски сили.'
    }, {
        question: 'Могат ли кучетата да са алергични към хора?',
        answers: [
            { text: 'Да', correct: true },
            { text: 'Не', correct: false },
        ],
        explanation: 'Кучетата наистина могат да бъдат алергични към вас. Тази алергия се нарича алергия към човешки пърхот. Точно както хората могат да реагират на клетките, освободени от кожата, косата или козината на домашните кучета, така и кучетата могат да имат алергични реакции към клетките на човешката кожа, изпуснати във въздуха. Пърхотът е нормална част от живота; въпреки че е микроскопичен, клетките на кожата ни, както и на нашите домашни любимци, се носят из въздуха и влизат в носа и гърлото ни ежедневно. Да, може да изглежда отвратително. Въпреки това вдишването на човешки пърхот може да предизвика алергични реакции при кучета.'
    }, {
        question: 'Защо когато чуем запис на собствения си глас, той ви звучи различно от това, което чуваме когато говорим?',
        answers: [
            { text: 'Защото сме глухи', correct: false },
            { text: 'Защото мозъкът ни вибрира', correct: false },
            { text: 'Заради кости в ухото ни', correct: true },
            { text: 'Заради неточност в произвеждането на звук на запис', correct: false },
            { text: 'Заради въздуха', correct: false },
        ],
        explanation: 'Три малки костици в средното ухо са причина за разликата между това, което си мислите, че е вашият глас и това, което другите чуват. Тези малки костици са ключови за възприемания шум от човек. Създаването на информация посредством вибрациите на тези костици в средното ухо се нарича „костна проводимост“, докато създаването на акустична информация от трептенето на въздуха извън ушите ни се нарича „въздушна проводимост“. Когато вие говорите, мозъкът ви съединява, смесва костната и въздушната проводимост в едно. Когато вие говорите, костиците в средното ви ухо вибрират малко по-силно, заради близостта на устата до ушите. Така гласът ви се заглушава и вие неправилно го възприемате като по-нисък. Когато чуете собствения си глас на запис, той ви звучи като по-висок. Защо обаче, това възприятие най-често е негативно? Защото хората най-често си имат собствена представа как звучи гласът им.'
    }, {
        question: 'Колко достига размаха на крилете на най-голямата пеперуда в света?',
        answers: [
            { text: '30 сантиметра', correct: false },
            { text: '1 метра', correct: false },
            { text: '5 милиметра', correct: true },
            { text: '10 километра', correct: false },
            { text: '30 милиметра', correct: false },
            { text: '7 метра', correct: false },
            { text: '6 сантиметра', correct: false },
        ],
        explanation: 'Най-голямата пеперуда в света - Attacus Atlas, живее в тропическите гори на Югоизточна Азия, архипелага на Малайзия, Индонезия и Борнео. Нарича се Атлас - на титана от гръцката митология, заради големия си размер. Attacus Atlas се храни само докато е ларва, а след като се превърне в пеперуда, няма устна кухина и единствената й цел е да се възпроизвежда - задача, която изпълнява веднага щом се роди. Тялото на пеперудата е непропорционално малко, в сравнение с крилата й, които достигат размах до 30 сантиметра. Тъй като не яде, а само се възползва от запасите от мазнини, натрупани по време на ларвната фаза, пеперудата се опитва да пести енергия, като лети възможно най-малко. Всеки полет може да отнеме дни от и без това краткия им живот. Те също така са много слаби и несигурни летци поради теглото си и затова почиват през деня и летят само през нощта.'
    }, {
        question: 'Какъв цвят се раждат фламинготата?',
        answers: [
            { text: 'Сиво', correct: true },
            { text: 'Кафяво', correct: false },
            { text: 'Синьо', correct: false },
            { text: 'Лилаво', correct: false },
            { text: 'Розаво', correct: false },
            { text: 'Бежаво', correct: false },
        ],
        explanation: 'В света има шест вида фламинго, но нито един вид не се ражда с този красив розов цвят. Вместо това бебетата фламинго са бледосиви. Чак когато пораснат те придобиват розов цвят и то дори това не е съвсем сигурно. Диетата на тези птици включва дребни риби, скариди и различни видове водорасли. Във всички тях е открито вещество, наречено каротеноид. Това е органичен пигмент (оцветител), естествено съдържащ се в храната и точно неговото ежедневно консумиране прави фламингото розово. А знаете ли, че някои фламинги са по-бледорозови от други? Това се дължи не само на храната, но и на слънчевата светлина. Ако някое от тях живее на по-слънчево място от другите си събратя, то може да не е толкова розово, защото Слънцето кара яркият му цвят да избледнява.'
    }, {
        question: 'Какво е националното животно на Шотландия?',
        answers: [
            { text: 'лъв', correct: false },
            { text: 'тигър', correct: false },
            { text: 'русалка', correct: false },
            { text: 'змей', correct: false },
            { text: 'орел', correct: false },
            { text: 'еднорог', correct: true },
            { text: 'чупакабра', correct: false },
            { text: 'ястреб', correct: false },
        ],
        explanation: 'В келтската митология и фолклор еднорозите са синоним на чистота, благородство, мъжество, смелост и ненадмината сила. Те също така притежават огромни лечебни сили. Според една легенда рогът на еднорога има способността да пречиства водата. Възхваляван с гордостта и силата си, този благороден звяр е представен в ранната версия на кралския шотландски герб от Уилям I през 12 век, пише The Culture Trip. През 15-и и 16-и век се появява на златните монети. Два еднорога откриваме да защитават щита на шотландския кралски герб до 1707 г. След обединението на Шотландия и Англия е добавен и лъв. Фолклорът твърди, че двете животни били заклети врагове в постоянна битка за титлата Цар на животните. Еднорогът се отличавал с хармония и сила, а лъвът – с доблест.'
    }, {
        question: 'Има ли испанският химн думи?',
        answers: [
            { text: 'Да', correct: false },
            { text: 'Не', correct: true },
        ],
        explanation: '„Кралският марш“ (на испански: Marcha Real) е националният химн на Испания. Той е един от само четирите национални химна в света (заедно с тези на Босна и Херцеговина, Косово и Сан Марино), който няма официални текстове (въпреки че в миналото е имал текстове, но те вече не се използват). Основава се на музиката на песента „Гренадирският марш“ (La Marcha Granadera).'
    }, {
        question: 'Колко е дълъг най-големият пешеходен маршрут в света?',
        answers: [
            { text: '530 км', correct: false },
            { text: '1 594 км', correct: false },
            { text: '5 487 км', correct: false },
            { text: '15 890 км', correct: false },
            { text: '22 980 км', correct: true },
        ],
        explanation: 'Картата по-горе показва най-дългия път в света, който може да се извърви пеша в непрекъсната разходка. Смята се, че това е разстоянието от Кейптаун, Южна Африка до Магадан, Русия с приблизително 22 980 км. Ако решите да направите този преход, трябва да имате предвид, че ще ви отнеме 4611 часа, което означава 192 дни безспирно ходене. Ако решите да ходите по 8 часа на ден, ще ви отнеме 576 дни (около година и половина), за да завършите „разходката“. По време на разходката ще изкачите около 119 345 метра и ще вървите по нанадолнище около 120 010 метра, което е еквивалент на цели 13 изкачвания и спускания на Еверест – най-високата точка на земята. Ще преминете през 16 държави, като най-дългият път в света минава през Сирия и Южен Судан, така че не е най-безопасното място за разходка.'
    }, {
        question: 'Приблизително колко видове киткат има в Япония?',
        answers: [
            { text: '5', correct: false },
            { text: '20', correct: false },
            { text: '100', correct: false },
            { text: '300', correct: true },
            { text: '2 000', correct: false },
            { text: '5 000', correct: false },
        ],
        explanation: 'Въпреки че всъщност не е японски продукт, Kit Kat станало изключително популярно в Япония, когато е пристигнало през 1973 г. заради щастливото си име. На японски Kit Kat или Kitto Katto звучи много като Kitto Katsu, японската фраза за „със сигурност ще спечелите“. Оттогава тези покрити с шоколад вафли се превърнали в голям хит в Япония. Kit Kats станали толкова популярни в Япония, че има повече от 300 различни вкуса.'
    }, {
        question: 'Какво са използвали за наметалата на Нощните Стражи от сериала Игра на Тронове?',
        answers: [
            { text: 'Килими от IKEA', correct: true },
            { text: 'Истински животински кожи', correct: false },
            { text: 'Фалшиви животински кожи', correct: false },
            { text: 'Боядисани родопски одеала', correct: false },
        ],
        explanation: 'Наметалата на войниците от нощната стража всъщност не са от екзотични кожи, а са обикновени рунтави килими oт IKEA.'
    }, {
        question: 'Колко видове банани приблизително растат в света?',
        answers: [
            { text: '5', correct: false },
            { text: '10', correct: false },
            { text: '50', correct: false },
            { text: '100', correct: false },
            { text: '500', correct: false },
            { text: '1 000', correct: true },
            { text: '5 000', correct: false },
            { text: '10 000', correct: false },
        ],
        explanation: 'Бананите се отглеждат в повече от 150 страни и всяка година се произвеждат 105 милиона тона плодове. Хората често приемат, че плодът банан расте по дърветата, но бананът е висока билка, която може да нарасне до 15 метра. По света растат над 1000 различни сорта банани, подразделени на 50 групи. Някои са сладки, като сорта Кавендиш, който е най-разпространеният.'
    }, {
        question: 'В коя държава има най-много серийни убийци?',
        answers: [
            { text: 'Китай', correct: false },
            { text: 'Япония', correct: false },
            { text: 'Канада', correct: false },
            { text: 'Русия', correct: false },
            { text: 'Великобритания', correct: false },
            { text: 'Америка', correct: true },
        ],
        explanation: 'Що се отнася до самия обем на серийните убийци, Съединените щати водят с огромна преднина. Въпреки че точният брой на серийните убийци в историята на САЩ варира значително в зависимост от източника (3204 в SKIC, 763 в Wikipedia), той неизменно е многократно по-висок сравнение с други страни (Англия със 166 в SKIC, Русия със 184 в Wiki). Въпреки че шепа серийни убийци са доста добре известни в Съединените щати, като Тед Бънди, Джефри Дамър, Чарлз Менсън, Джон Уейн Гейси, Рикардо Рамирес, Ед Гейн и все още неидентифицираният убиец от Зодиака, те са доста редки случаи. По-голямата част от серийните убийци не успяват да постигнат каквато и да е трайна национална или глобална известност.'
    }, {
        question: 'В Япония се използва повече хартия за манга от колкот за тоалетна хартия.',
        answers: [
            { text: 'Вярно', correct: true },
            { text: 'Грешно', correct: false },
        ],
        explanation: 'Аниме и манга индустрията са основният източник на доходи за хората в Япония и по-голямата част от икономиката им зависи от този сектор. И всъщност хората в Япония използват повече хартия за манга, отколкото тоалетна хартия. Според доклади за манга всеки месец се пускат повече от 600 категории манга. През 2020 г., нетната стойност на манга индустрията в Япония е била повече от 612 милиарда йени. Това само по себе си е рекорд. А твърдението, че се ползва повечче хартия за манга, отколкото за тоалетна хартия, не е изненада и донякъде е вярно, защото почти всяко домакинство в Япония разполага с модерни тоалетни бидета, които не изискват никаква употреба на хартия.'
    }, {
        question: 'Колко време е трябвало мангата One piece да продължи първоначално?',
        answers: [
            { text: '2 седмици', correct: false },
            { text: '6 месеца', correct: false },
            { text: '2 години', correct: false },
            { text: '5 години', correct: true },
            { text: '20 години', correct: false },
        ],
        explanation: 'Ода разкри, че първоначално е планирал One Piece да продължи пет години и че вече е планирал края. Въпреки това той е разбрал, че ще отнеме повече време, отколкото е очаквал, тъй като Ода е осъзнал, че харесва историята твърде много, за да я приключи в този период от време.'
    }, {
        question: 'Кое от изброените анимета е най-дълго?',
        answers: [
            { text: 'One piece', correct: false },
            { text: 'Pokémon', correct: false },
            { text: 'Sazae-San', correct: true },
            { text: 'Doraemon', correct: false },
            { text: 'Gundam', correct: false },
        ],
        explanation: 'През октомври 1969 г. Fuji Television стартира аниме сериал, който все още се излъчва и днес, което го прави един от най-продължителните телевизионни сериали в историята и най-продължителното анимационно шоу. Часът на излъчване е всяка неделя от 18:30 до 19:00 и никога не е променян от създаването си. На 5 септември 2013 г. това аниме бе отличено със Световния рекорд на Гинес за „Най-продължителен анимационен телевизионен сериал“.  Рекордът продължава да бъде чупен дори днес. В момента се състои от над 8540 излъчени епизода.'
    }, {
        question: 'Кой от изброените аниме филми има най-много световни доходи?',
        answers: [
            { text: 'Demon Slayer: Kimetsu no Yaiba – The Movie: Mugen Train', correct: true },
            { text: 'Spirited Away', correct: false },
            { text: 'One Piece Film: Red', correct: false },
            { text: 'Your Name', correct: false },
            { text: 'Suzume', correct: false },
        ],
        explanation: 'Demon Slayer: Kimetsu no Yaiba – The Movie: Mugen Train е на 1во място с $507,127,293 печалба. Spirited Away е на 2ро място с $395,580,000 печалба. Your Name е на 3то място с $382,238,181 печалба. Suzume е на 4то място с $324,185,112 печалба. One Piece Film: Red е на 6то място с $246,570,000 печалба.'
    }, {
        question: 'От къде Миязаки взима името на студио Гибли?',
        answers: [
            { text: 'Марка сладоледи', correct: false },
            { text: 'Прякор на самолет', correct: true },
            { text: 'Сън на Миязаки', correct: false },
            { text: 'От шега между Миазаки и най-добрия му приятел', correct: false },
            { text: 'Любимото животно на Миязаки', correct: false },
        ],
        explanation: 'Името "Ghibli" е избрано от Миязаки от Caproni Ca.309, италиански разузнавателен самолет от ерата на Втората световна война с прякор Ghibli. Името е избрано от Миязаки поради страстта му към самолети и летене, а също и заради идеята, че студиото ще "подуха нов вятър в аниме индустрията".'
    }, {
        question: 'От къде идва вдъхновението на Хаджиме Исаяма за създаването на Атака на Титаните?',
        answers: [
            { text: 'Книга', correct: false },
            { text: 'Разговор между Исаяма и негов приятел', correct: false },
            { text: 'Пияница', correct: true },
            { text: 'Билборд', correct: false },
            { text: 'Класическа картина', correct: false },
            { text: 'Манга', correct: false },
        ],
        explanation: 'В интервю за Nihon TV Исаяма споделил ,че докато работел в интернет кафенесе е натъкнал на пиян клиент. Преживяването го повлияло толкова много, че той бил вдъхновен да създаде манга за него. Тази манга се казва Attack on Titan. Според Исаяма клиентът му показал колко трудно може да бъде общуването с някого, въпреки че е от същия вид, и го накарал да разбере, че най-страшното животно е и най-познатото: човешкото същество.'
    }, {
        question: 'Какъв е правилният начин за четене на мана?',
        answers: [
            { text: 'Отдясно наляво и отгоре надолу', correct: true },
            { text: 'Отляво надясно и отгоре надолу', correct: false },
            { text: 'Отляво надясно и отдолу нагоре', correct: false },
            { text: 'Отдясно наляво и отдолу нагоре', correct: false },
        ],
        explanation: 'Традиционно манга историите се четат отдясно наляво и отгоре надолу, по същия начин като японската писменост. Разказът се съдържа в рамки, наречени панели. И така, за да прочетете страница от манга, започвате с панела в горния десен ъгъл и завършвате с панела в долния ляв ъгъл.'
    }, {
        question: 'Коя е най-продаваната манга на всички времена?',
        answers: [
            { text: 'Dragon Ball', correct: false },
            { text: 'Detective Conan', correct: false },
            { text: 'Bleach', correct: false },
            { text: 'Slam Dunk', correct: false },
            { text: 'Naruto', correct: false },
            { text: 'One piece', correct: true },
        ],
        explanation: 'Продажбите на мангата One Piece лесно надминават всичко останало в индустрията, с над 516 милиона продадени копия, което е повече от Наруто и Блийч взети заедно. Авторът Eiichiro Oda започна тази поредица през 1997 г. и все още публикува нови глави, въпреки че очаква поредицата да приключи до 2025 г. Тази манга за мореплаване също е част от един от най-печелившите медийни франчайзи, натрупал над 14,5 милиарда долара между своите манги , аниме, видео игри и свързани стоки.'
    }, {
        question: 'Мангата може да бъде категоризирана в пет различни типа, определени от тяхната целева аудитория. Коя от изброените думи НЕ Е част от тези типове?',
        answers: [
            { text: 'Shonen', correct: false },
            { text: 'Shojo', correct: false },
            { text: 'Shoji', correct: true },
            { text: 'Seinen', correct: false },
            { text: 'Josei', correct: false },
            { text: 'Kodomomuke', correct: false },
        ],
        explanation: 'Мангата се категоризира първо по аудитория, а след това по жанр. Shonen (за тинейджъри), Shojo (за тинейджърки), Seinen (за възрастни мъже), Josei (за възрастни жени), and Kodomomuke (за малки деца).'
    }, {
        question: 'Хората които илюстрират манга се наричат мангали?',
        answers: [
            { text: 'Вярно', correct: false },
            { text: 'Невярно', correct: true },
        ],
        explanation: 'Илюстраторите на манга се наричат мангака.'
    }, {
        question: 'Какъв е бъквалния превод на думата манга?',
        answers: [
            { text: 'Красота', correct: false },
            { text: 'Драскулка', correct: false },
            { text: 'Рисунка', correct: false },
            { text: 'Причудлива картина', correct: true },
            { text: 'Нарисувана книга', correct: false },
        ],
        explanation: 'Казано накратко, манга е японската дума за комикси, публикувани в Япония. Самата дума се състои от два знака: man 漫, което означава „причудлив“ и ga 画, което означава „картини“.'
    }, {
        question: 'Колко струва направата на един аниме епизод?',
        answers: [
            { text: '$300 - $500', correct: false },
            { text: '$1,000 - $3,000', correct: false },
            { text: '$10,000 - $20,00', correct: false },
            { text: '$50,000 - $70,000', correct: false },
            { text: '$140,000 - $180,000', correct: true },
            { text: '$1,000,000 - $2,000,000', correct: false },
        ],
        explanation: 'Създаването на аниме епизод струва около 140 000 до 180 000 долара в зависимост от използваните техники.'
    }, {
        question: 'Какво са гъбите?',
        answers: [
            { text: 'Животни ', correct: false },
            { text: 'Растения', correct: false },
            { text: 'Предмети', correct: false },
            { text: 'Гъби', correct: true },
        ],
        explanation: 'Гъбите не са нито растения, нито животни. Те се отнасят в отделно царство „Гъби“. Тези интересни творения на природата сякаш растат като растения, често дори приличат на тях, но от гледна точка на еволюцията имат много повече общи черти с животните. Както хората и животните вдишват и издишат, те усвояват кислород и отделят въглероден диоксид. Те нямат в своите тъкани хлорофил, чрез който растенията фотосинтезират, затова не се нуждаят от слънчева светлина, за да растат и разчитат на други организми, за да си набавят храна.'
    }, {
        question: 'Какво е Manhwa?',
        answers: [
            { text: 'Подразделение на мангата', correct: false },
            { text: 'Корейски комикс', correct: true },
            { text: 'Грешно написана манга', correct: false },
            { text: 'Корейска храна', correct: false },
            { text: 'Не означава нищо', correct: false },
        ],
        explanation: 'Manhwa се отнася за комикси, създадени от корейски художници и публикувани на корейски. Терминът manhwa започва да се използва през 20-те години на миналия век по време на японската окупация на Корея, когато много от културните елементи на Япония са включени в корейската култура. Manhwa се чете отляво надясно и хоризонтално за разлика от мангата. Manhwa не се отпечатва толкова често, колкото преди и сега се създава предимно дигитално и се намира онлайн под името „webtoons“.'
    },
];

const questionElement = document.getElementById('question');
const explanationConteiner = document.getElementById('explanation-contaner');
const explanationText = document.getElementById('explanation-text');
const answerButtons = document.getElementById('answer-buttons');
const nextButton = document.getElementById('next-btn');
nextButton.addEventListener('click', nextBtnClickHandler);

let shuffledQestions;
let currentQuestionIndex = 0;
let score = 0;

function startQuiz() {
    shuffledQestions = questions.sort(() => Math.random() - .5);
    currentQuestionIndex = 0;
    score = 0;
    nextButton.textContent = 'Next';
    showQuestion();
}

function showQuestion() {
    resetState();
    let currentQuestion = shuffledQestions[currentQuestionIndex];
    questionElement.textContent = currentQuestion.question;
    explanationText.textContent = currentQuestion.explanation;

    currentQuestion.answers.forEach(answer => {
        const button = document.createElement('button');
        button.textContent = answer.text;
        button.classList.add('btn');
        answerButtons.appendChild(button);
        if (answer.correct) {
            button.dataset.correct = answer.correct;
        }
        button.addEventListener('click', selectAnswer);
    });
}

function showScore() {
    resetState();
    questionElement.textContent = `You scored ${score} out of ${questions.length}!`;
    nextButton.textContent = 'Play Again';
    nextButton.classList.remove('hide');
}

function resetState() {
    nextButton.classList.add('hide');
    explanationConteiner.classList.add('hide');
    while (answerButtons.firstChild) {
        answerButtons.removeChild(answerButtons.firstChild);
    }
}

function selectAnswer(e) {
    const selectBtn = e.target;
    const isCorrect = selectBtn.dataset.correct === 'true';
    if (isCorrect) {
        selectBtn.classList.add('correct');
        score++;
    } else {
        selectBtn.classList.add('incorrect')
    }
    Array.from(answerButtons.children).forEach(button => {
        if (button.dataset.correct === 'true') {
            button.classList.add('correct');
        }
        button.disabled = true;
    });
    nextButton.classList.remove('hide');
    explanationConteiner.classList.remove('hide');
}

function nextBtnClickHandler() {
    if (currentQuestionIndex < questions.length) {
        currentQuestionIndex++;
        if (currentQuestionIndex < questions.length) {
            showQuestion();
        } else {
            showScore();
        }
    } else {
        startQuiz();
    }
}

startQuiz();